<template>
<div>
<h1 class="red">Hello {{ name }}!</h1>
  <p>

   Кажется, большинство имеющих фотоаппарат получают его в
подарок - на рождество или именины. Фотографический аппарат
относится к предметам, о которых нормальный человек мечтает
с детства, в то же время считая их излишними. Но к подаркам
у человека никогда нет правильного профессионального
подхода:  подаренным фотоаппаратом владелец его стреляет
направо и налево, как буйный помешанный, которому попал в
руки браунинг, - сам изумляясь, что иногда получается
снимок. При этом он никогда не пытается постичь великие
тайны - например, что же, собственно, делается там внутри:
он явно избегает касаться таких технических подробностей,
как шторка, резкость или, скажем, экспозиция. У него к
аппарату отношение отчасти суеверное:  бог пошлет - выйдет;
не пошлет - не выйдет. Говорю вам:  с дареным фотоаппаратом
профессионально работать невозможно.
   Если вы хотите заниматься фотографией профессионально, то
купите себе аппарат сами. Но предварительно надо примерно в
течение года объявлять при встрече всем знакомым, что вы
собираетесь приобрести фотоаппарат.
  </p>
</div>
</template>

<script>
export default {
  data () {
    return { name: 'companies' }
  }
}
</script>

<style>
.red {
  color: red;
}
</style>